tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "python@3.9"
brew "awscli"
brew "bat"
brew "cmake"
brew "coreutils"
brew "deno"
brew "exa"
brew "fzf"
brew "gcc"
brew "git"
brew "gnuplot"
brew "go"
brew "golangci-lint"
brew "llvm"
brew "neovim"
brew "nodebrew"
brew "ripgrep"
brew "terraform"
brew "tig"
brew "tmux"
brew "zsh"
brew "zsh-completions"
cask "alacritty"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "iterm2"
cask "keycastr"
cask "visual-studio-code"
