tap "cjbassi/ytop"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "reviewdog/tap"
brew "actionlint"
brew "cryptography"
brew "libsodium"
brew "ansible"
brew "little-cms2"
brew "jpeg-xl"
brew "aom"
brew "arp-scan"
brew "asciinema"
brew "awscli"
brew "bat"
brew "icu4c@76"
brew "boost"
brew "python@3.13"
brew "glib"
brew "cairo"
brew "cmake"
brew "coreutils"
brew "deno"
brew "docutils"
brew "dsq"
brew "libevent"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "tree-sitter"
brew "emacs"
brew "eza"
brew "harfbuzz"
brew "leptonica"
brew "libass"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "ghq"
brew "git"
brew "git-delta"
brew "git-secrets"
brew "gnupg"
brew "qt"
brew "gnuplot"
brew "go"
brew "go-task"
brew "gobject-introspection"
brew "golangci-lint"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "grex"
brew "guile"
brew "helix"
brew "hub"
brew "shared-mime-info"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "llvm"
brew "mas"
brew "mdcat"
brew "navi"
brew "neovim"
brew "nkf"
brew "nmap"
brew "nodebrew"
brew "protobuf"
brew "pv"
brew "ripgrep"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "sshuttle"
brew "terraform"
brew "terraform-ls"
brew "terraformer"
brew "tig"
brew "tmux"
brew "viu"
brew "watch"
brew "watchman"
brew "wget"
brew "yamlfmt"
brew "zig"
brew "zsh"
brew "cjbassi/ytop/ytop"
brew "reviewdog/tap/reviewdog"
cask "adobe-acrobat-reader"
cask "alacritty"
cask "android-studio"
cask "audacity"
cask "brave-browser"
cask "chromedriver"
cask "cool-retro-term"
cask "docker"
cask "flutter"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "google-chrome"
cask "hyper"
cask "iterm2"
cask "kap"
cask "keycastr"
cask "kitty"
cask "logi-options+"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "skim"
cask "slack"
cask "vnc-viewer"
cask "warp"
cask "wireshark"
cask "zoom"
mas "AmorphousDiskMark", id: 1168254295
mas "GarageBand", id: 682658836
mas "GeoGebra Classic 6", id: 1182481622
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "Logic Pro", id: 634148309
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PicGIF Lite", id: 844918735
mas "RunCat", id: 1429033973
mas "Skitch", id: 425955336
mas "Xcode", id: 497799835
vscode "asvetliakov.vscode-neovim"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "jdinhlife.gruvbox"
vscode "jebbs.plantuml"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-audio"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "vscodevim.vim"
vscode "yzane.markdown-pdf"
